Repository: displaynone/shield-authenticator
Catalog: src/locales/*/messages.po
Languages: ar, de, es, fr, it

source: Access to the camera was denied. To enable Shield Authenticator to utilize the camera, it is necessary to provide permission through the settings
ar: تم رفض الوصول إلى الكاميرا. لتمكين Shield Authenticator من استخدام الكاميرا ، من الضروري توفير إذن من خلال الإعدادات
de: Der Zugang zur Kamera wurde verweigert. Damit Shield Authenticator die Kamera verwenden kann, muss über die Einstellungen eine Berechtigung erteilt werden
es: Se denegó el acceso a la cámara. Para permitir que Shield Authenticator utilice la cámara, es necesario proporcionar permiso a través de la configuración
fr: L'accès à la caméra a été refusé. Pour permettre à Shield Authenticator d'utiliser la caméra, il est nécessaire de fournir une autorisation via les paramètres
it: L'accesso alla fotocamera è stato negato. Per abilitare Shield Authenticator a utilizzare la fotocamera, è necessario fornire l'autorizzazione attraverso le impostazioni

source: Add a new site
ar: أضف موقعًا جديدًا
de: Neue Seite hinzufügen
es: Añadir sitio
fr: Ajouter un nouveau site
it: Nuovo sito

source: Add token manually
ar: أضف الرمز المميز يدويًا
de: Token manuell hinzufügen
es: Agregar token manualmente
it: Aggiungi token manualmente

source: Backup your data
ar: النسخ الاحتياطي لبياناتك
de: Sichern Sie Ihre Daten
es: Copia de seguridad
fr: Sauvegardez vos données
it: Eseguire il backup dei dati

source: Cancel
ar: إلغاء
de: Stornieren
es: Cancelar
fr: Annuler
it: Annulla

source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
it: Completato

source: Confirm deletion
ar: تأكيد الحذف
de: Löschung bestätigen
es: Confirmar borrado
fr: Confirmer la suppression
it: Conferma l'eliminazione

source: Delete
ar: حذف
de: Löschen
es: Borrar
fr: Supprimer
it: Elimina

source: Enable
ar: تمكين
de: Aktivieren
es: Activar
fr: Activer
it: Abilitare

source: Enable camera
ar: تمكين الكاميرا
de: Kamera aktivieren
es: Habilitar cámara
fr: Activer la caméra
it: Abilita la fotocamera

source: Everything is prepared for you to add your sites
ar: كل شيء جاهز لإضافة مواقعك
de: Alles ist darauf vorbereitet, dass Sie Ihre Websites hinzufügen
es: Todo está listo para que añadas tus sitios
fr: Tout est préparé pour que vous ajoutiez vos sites
it: Tutto è pronto per aggiungere i tuoi siti

source: Fingerprint authentication
ar: مصادقة بصمات الأصابع
de: Fingerabdruckauthentifizierung
es: Autenticación por huella dactilar
fr: Authentification des empreintes digitales
it: Autenticazione delle impronte digitali

source: Generate file
ar: إنشاء ملف
de: Datei generieren
es: Generar fichero
fr: Générer un fichier
it: Genera file

source: If you want to restore your saved sites from a backup, you can load the file stored on your device. It's important to note that the existing sites will remain unchanged and won't be replaced
ar: إذا كنت ترغب في استعادة المواقع المحفوظة من نسخة احتياطية ، يمكنك تحميل الملف المخزن على جهازك. من المهم ملاحظة أن المواقع الحالية ستبقى دون تغيير ولن يتم استبدالها
de: Wenn Sie Ihre gespeicherten Websites aus einer Sicherung wiederherstellen möchten, können Sie die auf Ihrem Gerät gespeicherte Datei laden. Es ist wichtig zu beachten, dass die vorhandenen Websites unverändert bleiben und nicht ersetzt werden
es: Si quieres recuperar tu copia de seguridad, puedes cargar el fichero guardado en tu dispositivo. Es importante que sepas que los sitios existentes no serán reemplazados por los importados
fr: Si vous souhaitez restaurer vos sites enregistrés à partir d'une sauvegarde, vous pouvez charger le fichier stocké sur votre appareil. Il est important de noter que les sites existants resteront inchangés et ne seront pas remplacés
it: Se si desidera ripristinare i siti salvati da un backup, è possibile caricare il file memorizzato sul dispositivo. È importante notare che i siti esistenti rimarranno invariati e non verranno sostituiti

source: Load backup sites
ar: تحميل مواقع النسخ الاحتياطي
de: Backup-Sites laden
es: Cargar copia
fr: Charger des sites de sauvegarde
it: Carica siti di backup

source: Login with your fingerprint
ar: تسجيل الدخول ببصمة إصبعك
de: Melden Sie sich mit Ihrem Fingerabdruck an
es: Accede mediante tu huella dactilar
fr: Connectez-vous avec votre empreinte digitale
it: Accedi con la tua impronta digitale

source: No access to camera
ar: لا يمكن الوصول إلى الكاميرا
de: Kein Zugang zur Kamera
es: No se puede acceder a la cámara
fr: Pas d'accès à la caméra
it: Nessun accesso alla fotocamera

source: No results matching your search
ar: لا توجد نتائج مطابقة لبحثك
de: Keine Ergebnisse, die zu Ihrer Suche passen
es: No hay resultados para tu búsqueda
fr: Aucun résultat correspondant à votre recherche
it: Nessun risultato corrispondente alla tua ricerca

source: Processing
ar: معالجة
de: Verarbeitung
es: Procesando
fr: Traitement
it: Elaborazione

source: Restore sites
ar: استعادة المواقع
de: Websites wiederherstellen
es: Recuperar datos
fr: Restaurer des sites
it: Ripristina siti

source: Save site
ar: حفظ الموقع
de: Seite speichern
es: Guardar sitio
it: Salva sito

source: Scan QR code
ar: مسح رمز QR
de: QR-Code scannen
es: Escanear código QR
fr: Numériser le code QR
it: Scansione codice QR

source: Scan another code
ar: مسح رمز آخر
de: Scannen Sie einen anderen Code
es: Escanear otro código
fr: Analyser un autre code
it: Scansiona un altro codice

source: Search...
ar: بحث...
de: Suche...
es: Buscar...
fr: Recherche...
it: Ricerca...

source: Secure the access to your stored 2FA using your device fingerprint authentication
ar: تأمين الوصول إلى 2FA المخزن باستخدام مصادقة بصمات جهازك
de: Sichern Sie den Zugriff auf Ihre gespeicherte 2FA mithilfe der Fingerabdruckauthentifizierung Ihres Geräts
es: Segura el acceso a tus claves 2FA usando la autenticación por huella dactilar de tu dispositivo
fr: Fixez l'accès à votre 2FA stocké à l'aide de l'authentification des empreintes digitales de votre appareil
it: Proteggi l'accesso al 2FA memorizzato utilizzando l'autenticazione delle impronte digitali del dispositivo

source: The QR code can be easily recognized by simply pointing your device's camera at it
ar: يمكن التعرف على رمز الاستجابة السريعة بسهولة بمجرد توجيه كاميرا جهازك إليه
de: Der QR-Code kann leicht erkannt werden, indem einfach die Kamera Ihres Geräts darauf gerichtet wird
es: El código QR se puede reconocer simplemente apuntado a él la camara
fr: Le code QR peut être facilement reconnu en pointant simplement la caméra de votre appareil vers celui-ci
it: Il codice QR può essere facilmente riconosciuto semplicemente puntando la fotocamera del dispositivo verso di esso

source: To ensure that you don't lose your saved data, you can download a file of the sites and restore them at a later time
ar: للتأكد من عدم فقدان البيانات المحفوظة ، يمكنك تنزيل ملف من المواقع واستعادتها في وقت لاحق
de: Um sicherzustellen, dass Sie Ihre gespeicherten Daten nicht verlieren, können Sie eine Datei der Websites herunterladen und zu einem späteren Zeitpunkt wiederherstellen
es: Para asegurarse de que no pierdas tus datos guardados, puedes descargarte un fichero con los sitios y recuperarlos más tarde
fr: Pour vous assurer de ne pas perdre vos données enregistrées, vous pouvez télécharger un fichier des sites et les restaurer ultérieurement
it: Per assicurarti di non perdere i dati salvati, puoi scaricare un file dei siti e ripristinarli in un secondo momento

source: Token
ar: الرمز المميز

source: Token copied to clipboard
ar: تم نسخ الرمز المميز إلى الحافظة
de: Token in Zwischenablage kopiert
es: Tolen copiado
fr: Jeton copié dans le presse-papiers
it: Token copiato negli Appunti

source: Token name
ar: اسم الرمز
es: Nombre del token
it: Nome token

source: You can either use your device's camera to scan the 2FA QR code on the site, or manually enter the provided token and a name
ar: يمكنك إما استخدام كاميرا جهازك لمسح رمز 2FA QR على الموقع ، أو إدخال الرمز المميز المقدم والاسم يدويًا
de: Sie können entweder die Kamera Ihres Geräts verwenden, um den 2FA-QR-Code auf der Site zu scannen, oder das bereitgestellte Token und einen Namen manuell eingeben
es: Puede usar la cámara de su dispositivo para escanear el código QR 2FA en el sitio, o ingresar manualmente el token que te faciliten y un nombre
it: È possibile utilizzare la fotocamera del dispositivo per scansionare il codice QR 2FA sul sito oppure inserire manualmente il token fornito e un nome

source: {sitesProcessed, plural, one {Processed 1 site of {numberOfSites}} other {Processed # sites of {numberOfSites}}}
ar: {sitesProcessed, plural, one {موقع 1 معالج لـ {numberOfSites}} other {المواقع # المجهزة لـ {numberOfSites}}}
de: {sitesProcessed, plural, one {Processed 1-Site von {numberOfSites}} other {Processed # Sites von {numberOfSites}}}
es: {sitesProcessed, plural, one {Procesado 1 sitio de {numberOfSites}} other {Procesados # sitios de {numberOfSites}}}
fr: {sitesProcessed, plural, one {Site traité 1 de {numberOfSites}} other {Sites transformés # de {numberOfSites}}}
it: {sitesProcessed, plural, one {1 sito elaborato di {numberOfSites}} other {# siti trasformati di {numberOfSites}}}

source: Scan your website's 2FA QR code using your device's camera
fr: Analysez le code QR 2FA de votre site Web à l'aide de la caméra de votre appareil
